{
    "marttiini.aapa": [
        "The bold Aapa knife embodies the harsh atmosphere of the Finnish swamp landscape. The model combines the typical characteristics of two strong traditional knives: the blade of a classic Lapp knife and the handle of a Lynx knife. The blade is made of forged carbon steel. The handle is an earthy mix of curly birch waxed in a tar tone and reindeer antler bone. The new sheath type has a wider holster."
    ],
    "marttiini.antler-damascus": [
        "The Antler Damascus is the most prestigious knife we have ever made, since the establishment of our knife factory in 1928. It is the tour de force of knifemaking by our skilled professionals. The Antler Damascus has been carefully handcrafted using materials selected exclusively for this knife.",
        "The ultra-sharp blade is made of stainless Damascus steel. Damascus steel is crafted using technology in which two different top-grade steels are embedded together in 120 layers under high pressure and high temperature. Interlaying two different steels and using the traditional blacksmith techniques of forging, hammering and rolling in the right temperatures brings out the beautiful rose pattern. The Damascus blade is extremely durable and stays sharp for a long time.",
        "The rock-solid handle of the knife is made of Finnish moose antler. The handle has been elaborated by hand, which requires strong craftsmanship skills. The color of the antler is natural, no chemical whitening has been used. The cast ferrule imitates the rose pattern of the blade.",
        "Each of the Antler Damascus knife blades is individually numbered, making the knife not only a practical tool for the outdoors but also a unique collector’s item.",
        "Each knife is delivered in an elegant wooden gift box."
    ],
    "marttiini.arctic-circle-knife": [
        "Marttiini's northern history was the inspiration for this knife. The light coloured sheath and handle are inspired by our bright summer nights and the dark winter months are represented by the dark blade. Lapland is indeed a land of contrasts.",
        "The blade is made of carbon steel that is perfect for carving and is easy to re-sharpen to its original sharpness. Remember to take proper care of your carbon steel knife: always dry the blade carefully after each use and oil the blade with unsalted oil on a regular basis. This will ensure your knife will serve you loyally from one year to the next."
    ],
    "marttiini.auhto": [
        "Auhto refers to a riverside grove, which is a lush forest type located along rivers and streams. These areas are rich in deciduous trees and offer beautiful landscapes and diverse nature, making them excellent hiking destinations.",
        "In the Auhto unique knife, you can sense the green lushness of spring as nature awakens after winter. The handle is made of reindeer antler, dyed birch, and vulcanized fiber, representing this magnificent grove. The blade is a 6 cm Damascus steel blade, and the black sheath is made of genuine leather."
    ],
    "marttiini.basic-filleting-knife-10": [
        "The well fitting rubber handle and the flexible stainless steel blade ensure clean-cut fillets. This size of blade is best suited for processing small fish, such as trout and perch.",
        "The filleting knife is an excellent tool for other jobs in the kitchen. The knife is supplied with a practical plastic sheath.",
        "We recommend hand wash."
    ],
    "marttiini.basic-filleting-knife-15": [
        "The well fitting rubber handle and the flexible stainless steel blade ensure clean-cut fillets. This size of blade is best suited for processing fish of about 1 kg.",
        "The filleting knife is an excellent tool for other jobs in the kitchen. The knife is supplied with a practical plastic sheath.",
        "We recommend hand wash."
    ],
    "marttiini.basic-filleting-knife-19": [
        "The well fitting rubber handle and the flexible stainless steel blade ensure clean-cut fillets. This size of blade is best suited for processing of about 2-3 kg.",
        "The filleting knife is an excellent tool for other jobs in the kitchen. The knife is supplied with a practical plastic sheath.",
        "We recommend hand wash."
    ],
    "marttiini.bear-knife": [
        "The knife features Finland's national animal, the bear, in the cast ferrule of the knife. The handle, made of Finnish curly birch, has a finger groove to ensure a good grip. The 11 cm blade of the knife is made of easy-care stainless steel. The leather sheath is decorated with impressive prints.",
        "This knife is delivered in a wooden gift box. The popular Bear knife is a great gift or an impressive knife for regular use."
    ],
    "marttiini.black-8-folding-knife": [
        "The handle is made of fiber-reinforced composite G10. Eight-centimeter blade locks in the operating position with the liner lock. The handle is equipped with a belt clip, which allows the folding knife to be kept conveniently at your reach."
    ],
    "marttiini.cabin-chef-filleting-knife": [
        "Cabin Chef knives design inspired by northern nature, powered by form and function.",
        "Marttiini filleting knives are legendary for their sharpness and usability. The Filleting Knife is part of the Cabin Chef set designed by Harri Koskinen.",
        "The blade of the Filleting Knife is made of high-quality, durable stainless steel. The handle is made of Finnish thermally modified birch a material known for its durability and graceful aging as well as warm and pleasant feel grip. The matte finish ensures a safe grip even when wet.",
        "The harmonious combination of beautiful design and practicality, as well as durable natural materials, guarantee that the Cabin Chef Filleting Knife is a pleasure to use, time and time again.",
        "We recommend hand wash."
    ],
    "marttiini.cabin-chef-fish-fork": [
        "The Cabin Chef Fish Fork is a handy tool for fish filleting. The Fish Fork ensures a good grip of the fish, without having to worry that the knife will slip onto your fingers.",
        "The handle is made of Finnish thermally modified birch a material known for its durability and graceful aging as well as warm and pleasant feel grip. The matte finish ensures a safe grip even when wet.",
        "The blade of the Fish Fork is made of high-quality, durable stainless steel.",
        "The Fish Fork is part of the Cabin Chef set designed by Harri Koskinen. The harmonious combination of beautiful design and practicality, as well as durable natural materials, guarantee that the Cabin Chef knives are a pleasure to use, time and time again.",
        "We recommend hand wash."
    ],
    "marttiini.cabin-chef-kitchen-knife": [
        "This Chef Knife is a versatile kitchen knife that cuts, chops, slices and dices extremely smoothly. If you need only one knife for your camping and cabin kitchen, youve found the perfect knife! The Chef Knife is also a great, practical gift idea for anyone.",
        "The handle is made of Finnish thermally modified birch a material known for its durability and graceful aging as well as warm and pleasant feel grip. The matte finish ensures a safe grip even when wet.",
        "The blade of the Chef Knife is made of high-quality, durable stainless steel.",
        "The harmonious combination of beautiful design and practicality, as well as durable natural materials, guarantee that the Cabin Chef knives are a pleasure to use, time and time again.",
        "We recommend hand wash."
    ],
    "marttiini.cabin-chef-knife": [
        "Cabin Chef Knife is a versatile general purpose knife. This knife is excellent for chopping and cutting vegetables and meat, as well as doing small chores at the campfire.",
        "Marttiinis knife making tradition can be seen in the small detail of the blade: the slightly upturned tip of the spine. The purpose of the upturned tip was originally to make it easier to lift a hot pot on top of an open fire.",
        "The Knife is part of the Cabin Chef set designed by Harri Koskinen.",
        "The blade of the knife is made of high-quality, durable stainless steel. The handle is made of Finnish thermally modified birch a material known for its durability and graceful aging as well as warm and pleasant feel grip. The matte finish ensures a safe grip even when wet.",
        "The harmonious combination of beautiful design and practicality, as well as durable natural materials, guarantee that the Cabin Chef Knife is a pleasure to use, time and time again.",
        "We recommend hand wash."
    ],
    "marttiini.cabin-chef-knife-set": [
        "The Cabin Chef set, designed by Harri Koskinen, has the essential knives for the camping and cabin kitchen. The meticulously clean lines of the knives are designed to serve function and ergonomics. The harmonious combination of beautiful design and practicality, as well as durable natural materials, guarantee that the Cabin Chef knives are a pleasure to use, time and time again.",
        "The rounded square profile of the handle are designed to accommodate different grips required for different ingredients. The handles are made of Finnish thermally modified birch – a material known for its durability and graceful aging as well as warm and pleasant feel grip. The matte finish ensures a safe grip even when wet.",
        "The blades are made of high-quality, durable stainless steel with the utmost precision for the specific use of each knife.",
        "The set includes a chef knife, a filleting knife, a fish fork, two smaller knives and a sharpening stone wrapped in a leather knife roll. The Cabin Chef knives are available individually or as a set. The set does not include sheaths.",
        "We recommend hand wash."
    ],
    "marttiini.cabin-chef-little-knife": [
        "Cabin Chef Little Knife is a multipurpose knife with a handy size. It can be used as a mushroom knife as well as cutting, chopping and peeling root vegetables. It is also a perfect steak knife and performs well small chores at the camping site.",
        "The Knife is part of the Cabin Chef set designed by Harri Koskinen.",
        "The blade of the knife is made of high-quality, durable stainless steel. The handle is made of Finnish thermally modified birch a material known for its durability and graceful aging as well as warm and pleasant feel grip. The matte finish ensures a safe grip even when wet.",
        "The harmonious combination of beautiful design and practicality, as well as durable natural materials, guarantee that the Cabin Chef Knife is a pleasure to use, time and time again.",
        "We recommend hand wash."
    ],
    "marttiini.carbon-lapp-knife-240": [
        "Experience the Spark of the North! Fans of Marttiini throughout the world have been requesting a Lapp knife with a carbon steel blade. We listened – and proudly present the Carbon Lapp Knife 240.",
        "The Carbon Lapp Knife 240 is a stunningly beautiful knife with",
        "And, with regular maintenance, this knife will stay rust-free and serve you for years to come.",
        "For the handle material, we chose beautiful curly birch to contrast the dark carbon steel. For extra protection, a layer of see-through wax was added. The elegant sheath made of light brown leather seals the deal."
    ],
    "marttiini.chopping-board-large": [
        "Crafted from high-quality oak wood, this chopping board combines timeless design with exceptional durability, making it an essential addition to any kitchen. The natural strength of oak ensures long-lasting performance, while its elegant grain pattern adds a touch of rustic charm. Gentle on knives, it helps maintain sharpness, and as a naturally hygienic material, oak’s porous structure and tannins help reduce bacterial survival compared to many other surfaces.",
        "The cutting board should be washed with clean water after use, as soap is not recommended. If soap is applied, the washing should be done quickly, followed by careful rinsing and immediate drying with a clean cloth. To keep the board in the best condition, avoid placing it in a dishwasher. Over time, the surface may lose some of its original finish; in this case, a new layer of coating can be applied. For the best results, it is recommended to use Rubio Monocoat Oilplus 2c, which is the same protective treatment originally applied in the factory."
    ],
    "marttiini.chopping-board-small": [
        "Crafted from high-quality oak wood, this chopping board combines timeless design with exceptional durability, making it an essential addition to any kitchen. The natural strength of oak ensures long-lasting performance, while its elegant grain pattern adds a touch of rustic charm. Gentle on knives, it helps maintain sharpness, and as a naturally hygienic material, oak’s porous structure and tannins help reduce bacterial survival compared to many other surfaces.",
        "The cutting board should be washed with clean water after use, as soap is not recommended. If soap is applied, the washing should be done quickly, followed by careful rinsing and immediate drying with a clean cloth. To keep the board in the best condition, avoid placing it in a dishwasher. Over time, the surface may lose some of its original finish; in this case, a new layer of coating can be applied. For the best results, it is recommended to use Rubio Monocoat Oilplus 2c, which is the same protective treatment originally applied in the factory."
    ],
    "marttiini.ckp-bread-knife": [
        "The knife is excellent for cutting cabbage and similar vegetables.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-carving-knife": [
        "The design of the blade, made from stainless chrome steel, is specifically for the cutting and carving of meat.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-chef-s-knife-15": [
        "For smaller chopping, dicing and cutting jobs. Ideal for preparing a salad ... for anything!",
        "We recommend hand wash."
    ],
    "marttiini.ckp-chef-s-knife-21": [
        "The thick and robust blade makes this knife durable and strong. The larger handle is a comfortable fit even in larger hands.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-filleting-knife-19": [
        "The textured handle and finger guard ensure a safe and firm grip of the knife while you are handling a slippery fish. Handling the fish becomes easier when using a",
        "in addition to the sharp knife.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-fish-fork": [
        "The fork really proves its worth when removing the skin from a fish fillet. The fish fork ensures a good grip of the fish or fillet, without having to worry that the knife will slip onto your fingers. The Marttiini fish fork has a normal knife handle to enable you to get the best possible grip.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-fishing-set": [
        "The set contains the Marttiini filleting knife globally famous for its sharpness, and the fish fork to facilitate the work. The set also includes the snappy fishbone pliers.",
        "The set is delivered in a wooden gift box.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-knife-block-5-knives": [
        "This set includes five knives of different sizes, making food preparation easy as you always have the right tool at hand. The paring knife is intended for peeling, as its name suggests. The vegetable knife is suitable for cutting vegetables and filleting small fish. The bread knife cuts both hard and soft bread sharply and is also suitable for shredding cabbage. The fillet knife is designed for fish but is also suitable for removing membranes from meat. The chef’s knife is versatile, and its blade length is sufficient for larger ingredients. In the stand, the knives are kept separate from each other, which helps them stay sharp longer. After hand washing, the knives can be dried in this white beech stand. The knives remain sharp and in a good condition for longer, if stored in this block.",
        "The set contains five knives: peeling, vegetable, filleting, bread and cook's knives.(Products: 740114, 745114, 757114, 765114 ja 770114)",
        "We recommend hand wash."
    ],
    "marttiini.ckp-peeling-knife": [
        "The peeling knife is a handy tool for peeling fruit and cutting root vegetables.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-roast-fork": [
        "We recommend hand wash."
    ],
    "marttiini.ckp-roast-set": [
        "The set is delivered in a wooden gift box.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-tomato-knife": [
        "This knife has a serrated blade that cuts into the tomato skin with no nonsense. It is ideal for cutting thin tomato slices. Naturally, the knife can manage other cutting and slicing jobs that require precision.",
        "We recommend hand wash."
    ],
    "marttiini.ckp-vegetable-knife": [
        "The flexible blade is also excellent for cleaning small fish.",
        "We recommend hand wash."
    ],
    "marttiini.classic-filleting-knife-10": [
        "This model has been in production since the late 1960s and has been exported around the world for more than 50 years. With the superior finished, sharp and flexible stainless chrome steel blade it only takes a moment to make beautiful fish fillets.",
        "The mini filleting knife is excellent for processing smaller fish like trout and perch. A traditional leather sheath in a natural colour completes the package.",
        "We recommend hand wash."
    ],
    "marttiini.classic-filleting-knife-15": [
        "This model has been in production since the late 1960s and has been exported around the world for more than 50 years. With the superior finished, sharp and flexible stainless chrome steel blade it only takes a moment to make beautiful fish fillets.",
        "This blade length is suitable for processing fish of about 1 kg. A traditional leather sheath in a natural colour completes the package.",
        "We recommend hand wash."
    ],
    "marttiini.classic-filleting-knife-19": [
        "This model has been in production since the late 1960s and has been exported around the world for more than 50 years. With the superior finished, sharp and flexible stainless chrome steel blade it only takes a moment to make beautiful fish fillets.",
        "This blade length is suitable for processing fish of between 2-3 kg. A traditional leather sheath in a natural colour completes the package.",
        "We recommend hand wash."
    ],
    "marttiini.condor-big-game": [
        "This hunting and hiking knife is specifically designed for a firm grip. Its 13 cm long blade is made of matte-polished chrome steel, ensuring excellent durability. The knife is competitively priced compared to similar models, but the quality remains equally high. The rubber handle provides a secure grip even when your hands are wet."
    ],
    "marttiini.condor-classic": [
        "The textured rubber handle is combined with the legendary blade of the Lynx knife offering incomparable sharpness and featuring the traditional blood groove.",
        "For those who prefer knives with wood handles we have a",
        "available."
    ],
    "marttiini.condor-filleting-knife-10": [
        "The flexible and extremely sharp stainless steel blade ensures clean-cut fillets. This size of blade is best suited for processing small fish. The filleting knife is supplied with a black leather sheath.",
        "We recommend hand wash."
    ],
    "marttiini.condor-filleting-knife-15": [
        "The flexible and extremely sharp stainless steel blade ensures clean-cut fillets. This size is of blade is best suited for processing fish of about 1 kg.",
        "Many other kitchen jobs such as slicing tomato become easy with this knife. The filleting knife is supplied with a black leather sheath.",
        "We recommend hand wash."
    ],
    "marttiini.condor-filleting-knife-19": [
        "The flexible and extremely sharp stainless steel blade ensures clean-cut fillets. This size of blade is best suited for processing fish of about 2-3 kg.",
        "Many other kitchen jobs such as slicing tomato become easy with this knife. The filleting knife is supplied with a black leather sheath.",
        "We recommend hand wash."
    ],
    "marttiini.condor-fish-fork-plastic-sheath": [
        "The fork proves its worth especially when removing the skin from a fish fillet. It provides you with a good grip of the fish or fillet without you having to worry that the knife will slip on to your fingers.",
        "The Condor fillet fork has a normal knife handle to enable you to get the best possible grip. This fork is supplied with a plastic sheath.",
        "We recommend hand wash."
    ],
    "marttiini.condor-frontier": [
        "This large knife is the perfect choice for users with big hands. Its rubber handle provides an excellent grip, even when wearing gloves, and the finger guard adds extra safety. The rubber handle also feels comfortable in cold winter weather. This knife is ideal for both hunters and hikers. The blade is made of stainless steel with a Martef coating and is 13 cm long."
    ],
    "marttiini.condor-junior": [
        "The safe rounded tip protects junior carvers from puncture wounds and tip cuts. The blade is made from easy to maintain stainless steel. The sharpening of the blade is naturally the same as in the knives of more experienced carvers.",
        "Roughened rubber handle and finger guard ensure a firm grip of the knife. The handle fits into the hand of a child also by its size. And a proper knife certainly comes with the proper leather sheath."
    ],
    "marttiini.condor-skinner": [
        "The textured rubber handle and the finger guard ensure a safe and firm grip in the most demanding forest conditions.",
        "The easy to maintain stainless chrome steel blade maintains its sharpness for a long time. The design of the blade is extremely suitable for handling game, whilst carving is also effortless with this knife. Not suitable for splitting bones.",
        "For sharpening we recommend the Marttiini diamond sharpener."
    ],
    "marttiini.condor-timberjack": [
        "The blade of the Timberjack is made of carbon steel, which is perfect for carving, and is easy to resharpen when required. Remember to take proper care of your carbon steel knife. Always dry the blade carefully after each use and oil the blade with unsalted oil on a regular basis. This will ensure your knife will serve you loyally from one year to the next.",
        "The textured rubber handle and the finger guard ensure a safe and firm grip of the knife in the most demanding conditions. This knife is supplied with a leather sheath."
    ],
    "marttiini.condor-timberjack-plastic-sheath": [
        "The blade of the Timberjack is made of carbon steel, which is perfect for carving, and is easy to resharpen when required. Remember to take proper care of your carbon steel knife. Always dry the blade carefully after each use and oil the blade with unsalted oil on a regular basis. This will ensure your knife will serve you loyally from one year to the next.",
        "The textured rubber handle and the finger guard ensure a safe and firm grip of the knife in the most demanding conditions. This knife is supplied with a practical plastic sheath."
    ],
    "marttiini.condor-trailblazer": [
        "Hunting and Outdoor knife. The dirt and moisture repelling Martef coating reduces friction.",
        "Safe rubber handle with finger guard."
    ],
    "marttiini.condor-trailblazer-and-firestick": [
        "Essential products for hiking conveniently in one package! The knife and fire starters come together in a cardboard gift box at a special price. The Pioneer knife is made of coated stainless steel and features a comfortable rubber handle. The fire starters provide extra security, as they work even when wet, in case matches get soaked.",
        "(185018T) Hunting and Outdoor knife. The dirt and moisture repelling Martef coating reduces friction. Safe rubber handle with finger guard.",
        "(1516110) If your matches get wet or you run out of lighter fluid, you can always get a fire going with it. Our fire stick provides a hot spark even in the most severe weather conditions. Just pull the striker or the back of your knife firmly down the length of the stick and direct the sparks towards you tinder. Any dry material like wood chips and moss will do the trick. Enjoy your campfire!"
    ],
    "marttiini.damascus": [
        "The blade of the Marttiini Damascus knife is from stainless Damascus steel, where, by means of special technology two different top-grade steels are combined into 120 layers. The interlayering of the two different steels and the highly specialised machining bring out the beautiful pattern on the blade.",
        "The handle of the knife is made of Finnish curly birch, and the ferrules are cast. The beautiful pattern on the blade is echoed on the ferrule at the end of the handle.",
        "Marttiini Damascus knives are numbered by the production year, making each knife is a unique collector's item.",
        "Each knife is delivered in an elegant wooden gift box."
    ],
    "marttiini.deluxe-classic": [
        "The traditional Ilves blade features a blood groove and a pot hook. The beautifully waxed curly birch handle with finger guard fittings fits securely in the hand. This knife is perfect for hiking, hunting, and fishing. The same knife is also available with a rubber handle.",
        "Check out the same model with a textured rubber handle (",
        ")."
    ],
    "marttiini.deluxe-gourmet-steak-knife": [
        "Sharp steak knives are an essential part of the table setting when very sharp knives are required.",
        "These knives are available also as a 6 knife set in a wooden storage box (",
        ").",
        "We recommend hand wash."
    ],
    "marttiini.deluxe-gourmet-steak-knife-set": [
        "These steak knives are an excellent gift for all lovers of a good steak. The set includes six extremely sharp steak knives in a wooden storage box.",
        "Gourmet Steak Knives are available also separately (",
        ")."
    ],
    "marttiini.deluxe-junior": [
        "The ideal gift for a child who wants to learn wilderness skills and how to use a knife. The Deluxe Junior is a great choice as a first knife: it’s a proper, stylish knife with a number of added safety features.",
        "The rounded tip protects against puncture wounds. The handle, made of heat-treated birch, is durable and the size is suitable for a child’s hand. The handle ensures a firm grip and the finger guard prevents fingers from slipping onto the blade.",
        "The knife blade is made of easy-care, stainless steel. Naturally, a proper knife comes with a proper leather sheath.",
        "The Deluxe Junior is a knife developed jointly by Partioaitta and Marttiini and is only available from Partioaitta and Marttiini."
    ],
    "marttiini.deluxe-lynx": [
        "The impressive curly birch handle, combined with a cast finger guard, gives this knife a truly luxurious character. An excellent gift idea for a hiker or an avid hunter.",
        "The sheath of the knife is designed to withstand even harsh conditions. A handy flap makes sure this knife stays in the sheath safely."
    ],
    "marttiini.deluxe-roast-set": [
        "Carving the first slice of a roast is an act of ceremony – that’s why every feast needs a good knife. Whether it’s ham, poultry, or seitan you’re carving, Marttiini’s Deluxe Roast Set is an elegant two-piece set of cutlery to crown your banquet.",
        "The long, curved blade of the knife is ideal for carving slices, while the carving fork helps keep the roast in place. The handles are made of beautiful Finnish curly birch and feature finger guards and curved butts to ensure a good, firm grip.",
        "Every Deluxe Roast Set comes in a wooden gift box, making the set a great gift."
    ],
    "marttiini.deluxe-skinner": [
        "Deluxe Skinner is a hunting knife with a touch of luxury – waxed curly birch handle, stainless steel blade and leather sheath is a fine combination. The skinner blade is suitable for both skinning and carving, but not suitable for splitting bones."
    ],
    "marttiini.diamond-sharpener-flat": [
        "This sharpener is especially suitable for sharpening knives. The sharpener has two surfaces with different grit grades: first the blade is sharpened with circular movements on the rougher side, after which the blade edge is finished on the finer side by removing the circular marks.",
        "The sharpener also includes a groove for sharpening hooks. The roughened handle gives you a good grip.",
        "Use water while sharpening, then wash and dry the sharpener after use."
    ],
    "marttiini.diamond-sharpener-oval": [
        "The oval shape of this sharpener is best for sharpening products that have a curving blade, such as skinning knives, augers, scythes and sickles. The sharpener is also excellent for sharpening filleting knives and kitchen knives.",
        "The sharpener consists of two surfaces with different grit grades: first the blade is sharpened with circular movements on the rougher side, after which the blade edge is finished on the finer side by removing the circular marks. The sharpener also includes a groove for sharpening hooks. The roughened handle gives you a good grip.",
        "Use water while sharpening, then wash and dry the sharpener after use."
    ],
    "marttiini.diamond-sharpener-pen": [
        "With the diamond coated sharpener you can sharpen harder blade materials such as stainless chrome steel.",
        "This sharpener design is especially suitable for filleting knives and kitchen knives, but it is also used for for ice augers, skinning knives and gutting hooks. The sharpener also includes a sharpening groove for hooks.",
        "This small-size sharpener is easy to carry with you, and the actual sharpener is stored inside a case after use. A handy pocket clip makes sure that the sharpener stays in the pocket. Use water while sharpening, then wash and dry the sharpener after use."
    ],
    "marttiini.diamond-sharpening-steel": [
        "The diamond particles in the sharpener make sharpening of a knife simple and easy. With diamond coated sharpeners you can sharpen the hardest blades, such as stainless chrome steel.",
        "A practical hanging loop is located at the end of the handle. Wash and dry the sharpener after use."
    ],
    "marttiini.eagle-damascus": [
        "The Marttiini Eagle Damascus Knife combines three beautiful and durable materials – Damascus steel, heat-treated Finnish curly birch, and cast ferrules.",
        "Damascus steel is a highly valued material among knife enthusiasts. It consists of 120 layers of two different steels, forged together under high pressure and heat. This process creates an exceptionally hard blade (HRC 60) with a distinctive flowing pattern. The Damascus steel blade retains its sharpness for a long time.",
        "Eagle Damascus knives are individually numbered. The knife is delivered in wooden gift boxes."
    ],
    "marttiini.eagle-knife": [
        "Sharp and reliable, designed for daily use and built to last a lifetime. That is why the Eagle Knife is a timeless and respected gift item.",
        "Kotkapuukko was the first product in Marttiini’s range of animal themed knives, and it remains one of our most popular models. The eagle head pommel was designed by the famous jewelry designer Jorma Laine in the mid-1970s and it quickly became a success, leading to the production of other knives with brass bolsters.",
        "In many cultures, the eagle symbolizes strength, freedom, and keen vision. It is often associated with courage and leadership. For example, in ancient Rome, the eagle was the symbol of the Roman Empire, and in the United States, the bald eagle represents freedom and independence.",
        "The versatile Eagle Knife is a reliable knife fit for both outdoor enthusiasts and collectors. The stainless steel blade (1.4034, HRC 53,5-55) is versatile, while the heat-treated curly birch handle's wax coating ensures durability for years.",
        "Every Eagle Knife is delivered in an elegant wooden box."
    ],
    "marttiini.enamel-mug-37-dl-white": [
        "A durable and practical enamel mug with a fresh and modern look, made in collaboration with Finnish design company Muurla.",
        "This enamel mug is the perfect companion for your outdoor adventures – it is light-weight and easy to keep clean.",
        "The mug carries a carbon steel core, with a double coating of enamel. The rim is fully rounded for your comfort.",
        "Capacity 3.7dl. Dishwasher safe. Do not put in a microwave oven."
    ],
    "marttiini.fire-stick": [
        "If your matches get wet or you run out of lighter fluid, you can always get a fire going with it. Our fire stick provides a hot spark even in the most severe weather conditions.",
        "Just pull the striker or the back of your knife firmly down the length of the stick and direct the sparks towards you tinder. Any dry material like wood chips and moss will do the trick. Enjoy your campfire!",
        "Total length: 10 cm",
        "Total weight: 35g",
        "Lanyard: brown leather"
    ],
    "marttiini.fish-cleaner": [
        "The fish cleaner is a very handy tool. The curved blade makes it easy to open up the fish, while the serrated edge comes in handy for scaling.",
        "With the metal scoop at the end of the handle removing the intestines is clean and fast. The blade is protected by a plastic shield."
    ],
    "marttiini.fishermans-knife-condor": [
        "The serrated edge on the back of the stainless steel blade makes the removal of fish scales easy.",
        "The blade of the fisherman's knife is sharpened just like a normal Marttiini knife, therefore you can use this knife not only for processing fish but also for many jobs around the house or camp. The textured rubber handle and the finger guard ensure a firm grip of the knife even in cold and wet conditions.",
        "The knife is supplied with a black leather sheath.",
        "We recommend hand wash."
    ],
    "marttiini.gift-box-l": [
        "The gift box is made of sturdy cardboard, which can be recycled after use.",
        "The dimensions of the gift box are 380x60x50 mm. The gift box is included as an add on product for all products for which this box is suitable."
    ],
    "marttiini.gift-box-m": [
        "The dimensions of the gift box are 311x60x50 mm. The gift box is included as an add on product for all products for which this box is suitable."
    ],
    "marttiini.gift-box-s": [
        "The dimensions of the gift box are 260x60x50 mm. The gift box is included as an add on product for all products for which this box is suitable."
    ],
    "marttiini.golden-lynx": [
        "The Golden Lynx knife gets its name from its golden-colored bolster, which connects the light curly birch handle and the stainless steel blade. The knife offers an excellent grip, and the finger guard bolster adds extra safety for the user. The blade features the typical Ilves hook, making it easy to lift a coffee pot from the campfire. The light leather sheath is adorned with old patterns from Marttiini’s early days, which were hand-pressed at the time. This beautiful sheath is available only for the Golden Lynx model. It is safe to use even when your hands are wet or slippery."
    ],
    "marttiini.handy": [
        "In the 1970s almost every household in Finland had the Handy knife. It was a truly general purpose knife used for peeling potatoes as well as carving wood.",
        "The shortish blade of this knife is practical for jobs that require precision. In this updated model the traditional blade design is combined with a beautiful curly birch handle. The Handy comes with a stylish leather sheath."
    ],
    "marttiini.herb-knife-keraaja": [
        "In Finnish language the word ‘’kerääjä’’ means gatherer. The holes on the blade are meant for removing the leaves of smaller herbs like rosemary, peppermint or even basil. Serrated edge and the hook can be used for harvesting stronger and bigger herbs and plants. The size of the hook is perfect for cutting lupine plant for example.",
        "The blade is made of high end stainless steel used in high quality kitchen knives. The premium heat-treated birch handle is comfortable to use in both hands and in both ways, whatever edge of the blade you might be using. The knife comes in a genuine, chrome tanned matte brown leather sheath with silver foil debossing.",
        "The quick fix attachment belt makes it easy to attach the sheath to various places like the belt, belt loop, wrist or basket handle. Eyelet rivets offer an option to use a lanyard for example."
    ],
    "marttiini.jarvi-annual-knife-2026": [
        "The name Järvi – meaning “lake” in Finnish – captures Finland’s deep connection with its waters. The knife’s design reflects the tranquillity of the country’s countless lakes, the shimmer of clear waters, and the long-standing traditions of fishing. Imagine yourself in the gentle warmth of a lakeside sauna, watching the evening sun sink behind the islands as boats glide silently across the calm water. As twilight settles over the lake, the scene invites you to slow down, breathe in the stillness, and experience the peaceful rhythm of Finnish lake life — the very essence that inspired the Järvi Fillet.",
        "Every detail of the knife is designed to reflect this harmony between nature and craftsmanship. The handle combines dark, heat-treated curly birch with bright, stainless steel fittings. Natural materials and meticulous finishing create a harmonious composition where traditional craftsmanship meets modern design.",
        "The reflective laser engravings on the blade and bolster highlight subtle details and enhance the knife’s elegant character.",
        "and comes in a genuine black leather sheath, decorated with a lake-inspired pattern printed in blue foil."
    ],
    "marttiini.kaamos-carbon": [
        "The handle is made of stained birch. Its surface is slightly textured so you easily get a firm, safe grip of the knife.",
        "The blade is made of carbon steel that is perfect for carving and is easy to re-sharpen to its original sharpness. Remember to take proper care of your carbon steel knife. Always dry the blade carefully after each use and oil the blade with unsalted oil on a regular basis. This will ensure your knife will serve you loyally from one year to the next."
    ],
    "marttiini.kide-bread-knife": [
        "The bread knife with a serrated blade cuts clean slices without crumbs.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-carving-fork": [
        "To help you cut roast meat, and to lift and serve hot roast slices.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-carving-knife": [
        "An excellent general kitchen knife for effortless chopping, dicing and cutting.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-chef-s-knife-15": [
        "For smaller chopping, dicing and cutting jobs.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-chef-s-knife-21": [
        "An excellent general kitchen knife for all kinds of chopping, dicing and cutting jobs.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-fillet-knife-21": [
        "With the filleting knife you get clean-cut fish fillets easily. This knife with a flexible blade is also fit for cutting and carving meat.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-paring-knife": [
        "The paring knife with a curved blade is a handy tool for peeling fruit and cutting root vegetables.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners.",
        "We recommend hand wash."
    ],
    "marttiini.kide-santoku": [
        "Great Santoku knife for cutting root vegetables, slicing meat, chopping vegetables.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-tomato-knife": [
        "A handy knife with a serrated blade cuts clean slices. Excellent knife for cutting bread and tomato",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kide-vegetable-knife": [
        "The vegetable knife is a handy tool for peeling and cutting fruits and vegetables.",
        "The Kide series consists of sharp, easy-care kitchen knives and a roast fork. The German stainless steel and forged construction make them durable and they remain sharp in use. The Santoprene® handle is easy to keep clean and offers a good grip.",
        "Ergonomic handle is comfortable to use. We recommend hand wash and sharpening with Marttiini sharpeners."
    ],
    "marttiini.kiehinen": [
        "The blade is made of traditional carbon steel that is perfect for carving wood, and easy to re-sharpen to its original sharpness when needed.",
        "The handle is made of Finnish curly birch and the knife is protected with a beautiful natural coloured leather sheath.",
        "This knife is suitable for the daily use of both campers and craftsmen as well as for fishermen and hunters."
    ],
    "marttiini.kierinki": [
        "Kierinki is a knife designed by our skilled carpenter, showcasing the beauty of craftsmanship. Its handle combines thermally treated birch and curly birch, seamlessly complementing each other. The blade is made of wavy carbon steel, mimicking the unique marks of hand forging. The genuine brown sheath is adorned with beautiful gold foil detailing, depicting the intricacies of the carbon steel.",
        "This exquisite piece of craftsmanship is named after the hometown of our founder, Janne Marttiini, Kierinki. The village still houses the first workshop where Janne began honing his blacksmithing skills. Kierinki is suitable for all users and makes an excellent gift. It is versatile and can be used for hunting, fishing, and all kinds of outdoor activities."
    ],
    "marttiini.kirnu-knife-block": [
        "A stylish and practical knife block. The versatile block features space for various types of kitchen knives. Due to its removable inner part, the knife block is easy to clean, such as by rinsing with water.",
        "Hand wash only.",
        "Height 220 mm, diameter 110 mm. Materials: ABS, PP.",
        "Block does not include knives."
    ],
    "marttiini.kojamo-unique": [],
    "marttiini.lake-whisperer": [
        "This unique knife is inspired by a tranquil lake. The gray sky reflects off the water's surface, and just a few ripples from the wind make the blue water appear like a whisper. The blade is 6 cm of Damascus steel, where you can see waves as if something is breaking the water's surface. The handle is made of reindeer antler, bordered by plywood pieces in various shades of blue, creating the impression of a whisper. The sheath is genuine leather."
    ],
    "marttiini.lapp-knife-230": [
        ".",
        "The Lapp knife 230 is one of Marttiini's most popular knives and continues to maintain its place at the top of the sales ratings after many years of continuous production. The knife is excellent for hikers and hunters who are active knife users, and it also makes an ideal present.",
        "The stainless chrome steel blade and the sheath depict beautiful traditional themes from Lapland."
    ],
    "marttiini.lapp-knife-235": [
        "Traditionally finger guards are not part of Scandinavian knife culture, but in Central Europe for example, finger guards are commonly fitted to knives. A finger guard provides more safety for the knife user. For those who are a little less accustomed to using knives a model with a finger guard is especially justified. You can get a good grip of the knife and your hand will not slip on to the blade even in wet or cold conditions.",
        "This Lapp knife is an excellent general knife suitable for both outdoors and hunting. The stainless chrome steel blade and the sheath depict traditional themes from Lapland. The sheath also features a secure snap closure."
    ],
    "marttiini.lapp-knife-240": [
        ".",
        "The Lapp knife 240 is one of Marttiini's most popular knives and continues to maintain its place at the top of the sales ratings after many years of continuous production. The knife is excellent for hikers and hunters who are active knife users, and it also makes an ideal present or souvenir from a trip to Finland.",
        "The stainless chrome steel blade features a beautiful etched engraving depicting a Lappish theme, whilst the pattern on the sheath also reflects a strong Lappish heritage."
    ],
    "marttiini.lapp-knife-245": [
        "Traditionally finger guards are not part of Scandinavian knife culture, but in Central Europe for example, finger guards are commonly fitted to knives. A finger guard provides more safety for the knife user. For those who are a little less accustomed to using knives a model with a finger guard is especially justified. You can get a good grip of the knife and your hand will not slip on to the blade even in wet or cold conditions. This Lapp knife is an excellent general knife suitable for both outdoors and hunting.",
        "The stainless chrome steel blade and the sheath depict traditional themes from Lapland. The sheath also features a secure snap closure."
    ],
    "marttiini.lapp-knife-250": [
        "The Lapp knife 250 is one of Marttiini's most popular knives and continues to maintain its place at the top of the sales ratings after many years of continuous production. The knife is excellent for hikers and hunters who are active knife users, and it also makes an ideal present."
    ],
    "marttiini.lapp-knife-255": [
        "Traditionally finger guards are not part of Scandinavian knife culture, but in Central Europe for example, finger guards are commonly fitted to knives. A finger guard provides more safety for the knife user. For those who are a little less accustomed to using knives a model with a finger guard is especially justified. You can get a good grip of the knife and your hand will not slip on to the blade even in wet or cold conditions.",
        "This Lapp knife is an excellent general knife suitable for both outdoors and hunting. The stainless chrome steel blade and the sheath depict beautiful traditional themes from Lapland. The sheath also features a secure snap closure."
    ],
    "marttiini.lapp-knife-280": [
        "This impressive knife is almost half a meter long. The blade and the sheath are decorated with a traditional themes and scenery from Lapland. This knife is surely one to be noticed!",
        "As Crocodile Dundee said:"
    ],
    "marttiini.lapp-knife-antler": [
        "The handle of this traditional Lapp knife, also known as the leuku knife, combines Finnish curly birch with reindeer antler bone. The stainless chrome steel blade has a beautiful etched engraving with a Lappish theme. The leather sheath also reflects traditional Arctic patterns.",
        "This leuku knife is an excellent gift idea for all those who have lost their hearts to northern nature!"
    ],
    "marttiini.leather-sheath-l": [
        "The leather sheath makes sure that your folding knife travels with you safely and comfortably. The sheath has a belt loop for easy carrying. Genuine leather is extremely durable and easy to take care of.",
        "Brass snap and a silver-colored logo stamped into the sheath add the finishing touch to this fine sheath.",
        "The leather sheath is suitable for Marttiini MFK and MBL folding knives."
    ],
    "marttiini.leather-sheath-s": [
        "The leather sheath ensures that your folding knife travels with you safely and comfortably. The sheath has a belt loop for easy carrying. Genuine leather is extremely durable and easy to take care of.",
        "Cognac leather is a classic and elegant choice. Brass snap and a stamped logo add the finishing touch to this fine sheath.",
        "S-size for:",
        ",",
        ",",
        ","
    ],
    "marttiini.little-condor": [
        "The textured rubber handle and finger guard ensure a firm grip of the knife. The blade is made of easy to maintain stainless steel. The handle is designed to fit the hand of a youngster, but the knife is a handy tool for adults for carving and work that requires precision."
    ],
    "marttiini.lumberjack-antler": [
        "Looking for a reliable all-around knife to accompany you on your hiking trips? Look no further – the Lumberjack Antler's got your back. The carbon steel blade is easy to keep razor-sharp, while the heat-treated birch handle brings a breath of warmth to the design. Finished with reindeer antler for that feel of Northern mysticism."
    ],
    "marttiini.lumberjack-carbon": [
        "The blade is made of carbon steel that is perfect for carving and is easy to re-sharpen to its original sharpness. Remember to take proper care of your carbon steel knife: always dry the blade carefully after each use and oil the blade with unsalted oil on a regular basis. This will ensure your knife will serve you loyally from one year to the next.",
        "The handle of this knife is made from stained birch. Its surface is slightly textured so you easily get a firm, safe grip of the knife.",
        "This knife is also available with a stainless steel blade (",
        ")."
    ],
    "marttiini.lumberjack-stainless": [
        "Based on one of the most popular Marttiini knives, the Lynx Lumberjack Carbon, this version is made from easy-to-maintain stainless steel.",
        "The handle is made of stained birch. Its surface is slightly textured so you easily get a firm, safe grip of the knife."
    ],
    "marttiini.lusto-annual-knife-2025": [
        "Beautiful and practical Lusto Annual Knife is with you in every day outdoor life and it’s a great gift for a nature lover! Lusto is the Finnish word for an annual ring of a tree. Annual ring-shape is repeated in prints and the bottom of the handle made of plywood – the annual ring of every single piece is unique. The handle is made from heat treated birch with clear oil for extra protection. Classic Lapp knife shaped blade is made from stainless chromium steel. Lusto Annual Knife 2025 comes in a genuine, vegetable tanned brown leather sheath. Each knife is individually numbered."
    ],
    "marttiini.lynx-121": [
        "This handy general purpose knife is especially suitable for carving dried salted meat and for the precise cutting of wood. The knife features an easy to maintain stainless chrome steel blade and a leather sheath in the traditional style."
    ],
    "marttiini.lynx-129": [
        "This traditional knife, designed by the founder of Marttiini, is an excellent general purpose knife for all outdoor activities. The sharpness of the Lynx blade is legendary, the handle is of beautiful Finnish birch.",
        "The design and decorations on the sheath reflect Marttiini's strong Lappish traditions."
    ],
    "marttiini.lynx-131": [
        "This knife has remained in the Marttiini range almost continuously since the company was formed in 1928. The years have not reduced its popularity as the king of general purpose knives. This knife continues to be one of Marttiini's best selling knives.",
        "A traditional curly birch handle combined with the legendary sharp Lynx blade with the characteristic design feature of the slightly upturned blade tip. The design and decorations on the sheath also reflect our strong northern roots.",
        "An excellent general purpose knife for all outdoor activities!"
    ],
    "marttiini.lynx-132": [
        "The most traditional Marttiini knife with a beautiful sheath.",
        "The leather tassel at the tip of the sheath depicts the tuft of hair on the tip of the ears of a lynx. It said to frighten away the bad spirits so that the knife will be used only for peaceful purposes."
    ],
    "marttiini.lynx-134": [
        "The 134 Lynx knife combines practical features with stunning details. This impressive knife is perfect for any outdoors person or",
        ".",
        "The handle is made of waxed curly birch – the cast finger guard adds a hint of luxury. The blade is made of practical stainless chrome steel. A durable and beautiful leather sheath is included.",
        "The same knife is available also with a different sheath design :"
    ],
    "marttiini.lynx-138": [
        "This Lynx knife has 13 cm blade - the blade also features the traditional \"blood groove\", which reduces suction when carving meat. Leather sheath is supplied with a tightening strap."
    ],
    "marttiini.lynx-139": [
        "This knife has a 13 cm long blade of stainless chrome steel featuring the traditional upturned point. The handle is of curly birch, and the leather sheath features traditional Lappish scenes."
    ],
    "marttiini.lynx-black-edition": [
        "The forged carbon steel blade is perfect for carving; it is also easy to sharpen to its original sharpness."
    ],
    "marttiini.lynx-forged": [
        "The blade is made of carbon steel and is perfect for carving; it is also easy to sharpen to its original sharpness. The handle is beautifully waxed curly birch, adding elegance and durability to the knife. The sheath is a traditional Ilves sheath made from genuine vegetable-tanned leather. This knife is an excellent choice for both carving and hiking."
    ],
    "marttiini.maarjakas": [
        "Marjakaas refers to curly birch, which is a valuable wood material. Curly birch has dark streaks within the wood and is a popular material for decorative items. Each curly birch is unique in its pattern, just like this Marjakaas knife. The handle of the knife is made of beautiful heat-treated curly birch, adorned with light untreated curls, reindeer antler, and dyed birch veneer. The blade is a stunning 10 cm Damascus steel, and the black sheath is genuine leather."
    ],
    "marttiini.martef-big-game": [
        ".",
        "The dirt and moisture repelling Martef coating reduces friction to almost zero whilst protecting the blade against corrosion. Due to the coating the blade moves extremely smoothly through cut meat or fish, and cleaning the blade after use is extremely easy.",
        "is an impressive knife for dealing with the carcasses of large animals. The handle of the knife is larger than usual, so it fits perfectly in a bigger hand and offers an improved grip. This knife also features the safe textured rubber handle and the finger guard."
    ],
    "marttiini.martef-carving-knife": [
        "The dirt and moisture repelling Martef coating reduces friction to almost zero whilst protecting the blade against corrosion. Due to the coating the blade moves extremely smoothly through cut meat or fish, and cleaning the blade after use is extremely easy.",
        "This knife works like a dream for both cutting and butchering meat. The familiar handle design is combined with a stainless blade suitable for cutting meat, which is coated with Martef to reduce friction and make your cutting chores easier. The leather sheath is practical for carrying the knife with you on your hunting trips."
    ],
    "marttiini.martef-filleting-knife-15": [
        "The Martef coating reduces friction to almost zero while protecting the blade against corrosion. Cleaning the blade after use is extremely easy.",
        "The textured rubber handle and the finger guard ensure a firm grip of the knife even in difficult conditions. This blade length is suitable for processing fish of about 1 kg.",
        "Many other kitchen chores, such as slicing vegetables, become easy with this knife. The filleting knife is supplied with a leather sheath.",
        "We recommend hand wash.",
        "This knife is also available with a plastic sheath (",
        ")."
    ],
    "marttiini.martef-filleting-knife-15-plastic-sheath": [
        "The Martef coating reduces friction to almost zero while protecting the blade against corrosion. Cleaning the blade after use is extremely easy.",
        "The textured rubber handle and the finger guard ensure a firm grip of the knife even in difficult conditions. This blade length is suitable for processing fish of about 1 kg. Many other kitchen chores, such as slicing vegetables, become easy with this knife. The filleting knife comes with a plastic sheath.",
        "We recommend hand wash."
    ],
    "marttiini.martef-filleting-knife-19": [
        "The Martef coating reduces friction to almost zero while protecting the blade against corrosion. Cleaning the blade after use is extremely easy.",
        "The textured rubber handle and the finger guard ensure a firm grip of the knife even in difficult conditions. This blade length is suitable for processing fish of about 2-3 kg.",
        "Many other kitchen chores, such as slicing vegetables, become easy with this knife. The filleting knife is supplied with a leather sheath.",
        "We recommend hand wash.",
        "This knife is also available with a plastic sheath (",
        ")."
    ],
    "marttiini.martef-filleting-knife-19-plastic-sheath": [
        "The Martef coating reduces friction to almost zero while protecting the blade against corrosion. Cleaning the blade after use is extremely easy.",
        "The textured rubber handle and the finger guard ensure a firm grip of the knife even in difficult conditions. This blade length is suitable for processing fish of about 2-3 kg. Many other kitchen chores, such as slicing vegetables, become easy with this knife.",
        "The filleting knife is supplied with a plastic sheath.",
        "We recommend hand wash."
    ],
    "marttiini.martef-filleting-knife-23": [
        ".",
        "The Martef coating reduces friction almost to none while protecting the blade against corrosion. Cleaning the blade after use is extremely easy. The roughened rubber handle and the finger guard ensure a firm grip of the knife even in difficult conditions. This blade lenght is suitable for the biggest whoppers. The filleting knife comes with a leather sheath.",
        "We recommend hand wash."
    ],
    "marttiini.martef-fishing-knife": [
        "The serrated edge on the back of the Martef coated stainless steel blade makes the removal of fish scales easy.",
        "The blade of the fisherman's knife is sharpened just like a normal Marttiini knife, therefore you can use this knife not only for processing fish but also for many jobs around the house or camp. The textured rubber handle and the finger guard ensure a firm grip of the knife even in cold and wet conditions.",
        "The knife is supplied with a black leather sheath.",
        "We recommend hand wash."
    ],
    "marttiini.martef-skinner": [
        "The dirt and moisture repelling Martef coating reduces friction to almost zero whilst protecting the blade against corrosion. Due to the coating the blade moves extremely smoothly through cut meat or fish, and cleaning the blade after use is extremely easy.",
        "knife is the most frequently sold knife in the Hunting series. The blade is produced from stainless steel and by design it is excellent for both skinning game and for carving. Not suitable for splitting bones. The textured orange rubber handle and the finger guard ferrule ensure a good grip in demanding conditions. The knife is supplied with a black leather sheath."
    ],
    "marttiini.martef-skinning-hook": [
        "The dirt and moisture repelling Martef coating reduces friction to almost zero whilst protecting the blade against corrosion. Due to the coating the blade moves extremely smoothly through cut meat or fish, and cleaning the blade after use is extremely easy.",
        "is an excellent tool for opening deer. The hook at the back of the knife helps to open the animal without touching internal organs, whilst the round shape of the blade ensures that the hide comes away cleanly and intact. Hook is not suitable for cutting bones. The hook can be sharpened with a pen type sharpener (such as the",
        ").",
        "The orange rubber handle and finger guard ensure user comfort and safety. Due to the sharpening angle of the stainless chrome steel blade, the knife can be used as a normal knife. A true multi-purpose knife for hunters."
    ],
    "marttiini.marttiini-camping-axe": [
        "Our axe series follow the example set by Marttiini knives.",
        "We combined modern technology with traditional handicraft. The result is a family of three durable and reliable axes.",
        "The Camping Axe have more sturdy and shaped handle. They ensure a safe grip. The blade is heavier, which makes the Camping Axe great for bigger tasks as well. Blade: 600 g.",
        "For materials, we chose quality carbon steel, beautiful ash wood and timeless leather."
    ],
    "marttiini.marttiini-hiking-axe": [
        "Our axe series follow the example set by Marttiini knives.",
        "We combined modern technology with traditional handicraft. The result is a family of three durable and reliable axes.",
        "For materials, we chose quality carbon steel, beautiful ash wood and timeless leather.",
        "The Marttiini Hiking Axe is the most lightweight in the series. It is easy to carry with during longer hikes. Blade: 300 g."
    ],
    "marttiini.marttiini-tote-bag": [
        "The tote bag is made of sturdy material and is comfortable to use. The tote bag will hold everything you need in your daily life – including your laptop. The neat tote bag, equipped with the Marttiini logo, looks stylish on your shoulder.",
        "The light tote bag can be folded into a small square, making it easy to keep with you as a shopping bag or a backup bag when travelling.",
        "The tote bag is made of 100% recycled materials. If necessary, you can handwash the bag in lukewarm water."
    ],
    "marttiini.marttiini-trekking-axe": [
        "Our axe series follow the example set by Marttiini knives.",
        "We combined modern technology with traditional handicraft. The result is a family of three durable and reliable axes.",
        "The Trekking Axe have more sturdy and shaped handle. They ensure a safe grip. The blade is heavier, which makes the Trekking Axe great for bigger tasks as well. Blade 500 g.",
        "For materials, we chose quality carbon steel, beautiful ash wood and timeless leather."
    ],
    "marttiini.mef8-folding-knife": [
        "The stainless steel blade is secured in the open position with a liner lock.",
        "Fiber-enforced G-10 handle with a groove-pattern guarantees secure hold. Low profile pocket clip for easy storage."
    ],
    "marttiini.mfk-curly-birch-folding-knife": [
        "The handle is decorated with beautiful Finnish curly birch. The blade is made of japanese stainless steel and has a satin finish. Belt clip on the handle."
    ],
    "marttiini.moose-black": [
        "Moose is a valuable and respected character in Finnish forests that can never been appraised too much. The moose in all its glory is depicted on the cast ferrule of the knife. The birch tree handle has a black leather paint and clear wax coating for extra protection. The blade is made from carbon steel. Moose Black knife comes in a genuine, vegetable tanned glossy black leather sheath with gold foil de-bossing. A knife is delivered in a stained black wooden gift box."
    ],
    "marttiini.moose-knife": [
        "The Moose Knife is a high-quality design knife. This knife is at the same time an impressive collector’s item and a reliable tool. Moose, bearing a crown of antlers, is the king of the northern forests and it has been immortalized in the cast ferrule of the knife.",
        "The ultra sharp blade is made of carbon steel. The precious colour of the handle is achieved by thermal treatment of the wood, which also provides the handle with excellent protection against moisture.",
        "This knife is delivered in a wooden gift box."
    ],
    "marttiini.mushroom-knife": [
        "The Marttiini mushroom knife features a handy cleaning brush at the end of the handle for neatly removing any debris from the mushrooms. The blade is exactly the right shape and length for cutting delicate mushrooms. The knife is designed to be totally practical and it is supplied with a leather sheath to be kept in the pocket or on the belt."
    ],
    "marttiini.mushroom-knife-keraaja": [
        "In Finnish language the word ‘’kerääjä’’ means gatherer. The premium heat-treated birch handle is turned in a direction counter to the blade's grinding. This design facilitates a more comfortable grip, drawing inspiration from the inward movement most common in mushroom foraging.",
        "The curved shape of the blade facilitates smooth slicing through the stem, preserving the integrity of the underlying fungal mycelium and preventing any disruption to its growth. The blade is made of high end stainless steel used in high quality kitchen knives.",
        "The brush is firm enough to remove dirt, debris and bugs, but soft enough to avoid damaging delicate mushrooms. It is made of natural animal hair. The knife comes in a genuine, chrome tanned matte brown leather sheath with silver foil debossing. The quick fix attachment belt makes it easy to attach the sheath to various places like the belt, belt loop, wrist or basket handle. Eyelet rivets offer an option to use a lanyard for example."
    ],
    "marttiini.mushroom-knife-neck-sheath": [
        "The Marttiini mushroom knife features a handy cleaning brush at the end of the handle for neatly removing any debris from the mushrooms. The blade is exactly the right shape and length for cutting delicate mushrooms.",
        "The sheath of this knife can be easily hung from the neck. The strap includes a safety mechanism, which opens the strap when it becomes entangled. It also includes a handy clip for attaching the knife to a jacket so that it will not be in the way when stooping to pick mushrooms."
    ],
    "marttiini.mushroom-knife-ruska": [
        "In Finnish language the word ‘ruska’ is used to describe the beginning of autumn when the leaves change to bright colours like red, yellow and orange. It’s also the best time for mushroom foraging.",
        "Bright red handle makes it easier to find the knife in the nature, as it might sometimes get lost. The shape of the curved blade enables smooth slicing of the stem without affecting or uprooting the underlying fungi mycelium. The brush is stiff enough to remove dirt, debris and bugs, but soft enough to not damage the mushrooms. The knife comes in a genuine, chrome tanned matte black leather sheath with silver foil de-bossing. The elastic attachment cord makes it easy to attach the sheath to various places like the belt, belt loop, wrist or the basket handle."
    ],
    "marttiini.nylon-sheath-l": [
        "Extremely durable high-grade nylon fabric, which is puncture-proof and tear-resistant, as well as heat and wear resistant and fast-drying. These properties make it easy to maintain, light and pleasant to use.",
        "For items: 930112 MBL Rosewood Folding knife, 930115 MBL Curly Birch Folding Knife"
    ],
    "marttiini.nylon-sheath-m": [
        "Extremely durable high-grade nylon fabric, which is puncture-proof and tear-resistant, as well as heat and wear resistant and fast-drying. These properties make it easy to maintain, light and pleasant to use.",
        "For MFK Folding knives, MEF8 Folding knife, MEF OR8 Folding knife."
    ],
    "marttiini.nylon-sheath-s": [
        "Extremely durable high-grade nylon fabric, which is puncture-proof and tear-resistant, as well as heat and wear resistant and fast-drying. These properties make it easy to maintain, light and pleasant to use.",
        "For items Black",
        "and"
    ],
    "marttiini.paljakka": [
        "The treeless area of the fell is called \"paljakka.\" Often, it is a barren, rocky terrain with little vegetation. This description fits this unique knife well. The earthy colors are represented in the handle made from reindeer antler. The 6 cm blade is stunning Damascus steel with beautiful patterns. The black sheath is genuine leather."
    ],
    "marttiini.puzzle": [
        "This unique knife embodies both sun and shadow. The handle beautifully alternates between dark, heat-treated curly birch and light curly birch, with reindeer antler adding a lively contrast. The blade is a stunning 6 cm Damascus steel, and the sheath is crafted from black leather."
    ],
    "marttiini.raja": [],
    "marttiini.ranger": [
        "Marttiini Ranger is a robust and reliable wilderness knife that cuts, carves and even splits firewood. The handle combines the colors of Finnish curly birch and thermally heated birch. The strong Lapp knife blade is made of stainless steel and is designed in accordance to ancient Lapp knife principles."
    ],
    "marttiini.rooki": [
        "Rooki is a Lappish word, meaning a spotted reindeer – a rare and distinctive creature. Its unique coat pattern sets it apart from the herd, making it truly special. In the same way, the Rooki knife embodies individuality and uniqueness: its materials, shape, and patterns distinguish it from all others, creating an exceptionally rare piece of Marttiini's Unique collection.",
        "These Unique by Marttiini knives are some of the most prestigious knives we have ever made, each knife is a unique piece. These knives are designed to be elegant and beautiful collector's items. Our skilled professionals have made this knife using exclusive materials selected solely for this knife.",
        "At Marttiini, we have a long history with traditional materials from Finland, such as curly birch and reindeer antler bone. On these Unique knives, we combine these traditional materials in various ways to create a special design for each Unique knife.",
        "The Damascus blade is made by combining two different types of steel in thin layers. The blade has 120 steel layers that have been welded together under extreme pressure and heat. The result is a beautifully patterned, stainless and very hard blade (HRC 60) that stays sharp even in extended use.",
        "Every Unique by Marttiini knife is a one of a kind. They represent the beauty and toughness of the North."
    ],
    "marttiini.salmon-filleting-knife": [
        "The Kojamo is no ordinary salmon. He’s the big, hooked-jawed old male—the king of Finland’s wild rivers. Known for his strength, beauty, and legendary glow (they say his scales shine brighter than the stars), Kojamo has ruled the northern waters for generations. Marttiini created Salmon Filleting Knife as a tribute to this mighty fish.",
        "Sharp, flexible, and built to last—this knife makes filleting effortless anywhere, from lakeside to kitchen. With a durable heat-treated curly birch handle, cast ferrules and elegant gift box, it’s made for both collectors and everyday anglers."
    ],
    "marttiini.salmon-knife": [
        "This design knife is an impressive collector’s item and a reliable tool. Stainless steel is an excellent material for regular use – the material stays rust-free and sharp for a long time. Thermal treatment of the curly birch wood gives the handle a good protection against moisture.",
        "This knife is delivered in a wooden gift box."
    ],
    "marttiini.scout-s-knife": [
        "A knife is an essential part of every scout’s gear. The Marttiini Scout Knife has been a reliable companion for decades. The double-sided finger guard enhances user safety. The blade is made of easy-to-maintain chrome steel. The sheath with a snap closure features an embossed scout emblem, giving the knife a traditional look. This knife is an excellent general-purpose knife for young users, as it allows them to safely practice their knife-handling skills."
    ],
    "marttiini.sharpening-steel": [
        "Fitted with a practical hanging loop at the end of the handle. Wash and dry the sharpener after use."
    ],
    "marttiini.sharpening-stone": [
        "The main minerals are quartz, feldspar and mica.The sharpener also includes a groove for sharpening hooks.",
        "This sharpening stone is also available in a handy leather sheath (",
        ").",
        "See also Marttiini diamond sharpeners."
    ],
    "marttiini.sharpening-stone-leather-sheath": [
        "The main minerals are quartz, feldspar and mica. The sharpener also includes a groove for sharpening hooks. The sharpening stone is in a handy leather sheath."
    ],
    "marttiini.snappy": [
        "The 6 cm long carbon steel blade is handy in use and easy to keep sharp. The handle shape follows the traditional Marttiini Lynx handle. Birch handle with waxed finish gives you a good grip on the knife. Black leather sheath with printed Marttiini logo pattern."
    ],
    "marttiini.snow-white": [
        "This unique knife is named after the natural white shades of snow. The knife features a 10 cm Damascus blade with a new blade pattern called Sparse Twist. The handle is made of reindeer antler and juniper wood. The sheath is made of genuine snow-white leather.",
        "These Unique by Marttiini knives are some of the most prestigious knives we have ever made, each knife is a unique piece. These knives are designed to be elegant and beautiful collector's items. Our skilled professionals have made this knife using exclusive materials selected solely for this knife.",
        "At Marttiini, we have a long history with traditional materials from Finland, such as curly birch and reindeer antler bone. On these Unique knives, we combine these traditional materials in various ways to create a special design for each Unique knife.",
        "The Damascus blade is made by combining two different types of steel in thin layers. The blade has 120 steel layers that have been welded together under extreme pressure and heat. The result is a beautifully patterned, stainless and very hard blade (HRC 60) that stays sharp even in extended use.",
        "Every Unique by Marttiini knife is a one of a kind. They represent the beauty and toughness of the North."
    ],
    "marttiini.soft-handle-hunting": [
        "Soft Handle Hunting knife combines a smoothly contoured handle that provides a comfortable grip with a 13 cm long chrome blade which ensures excellent usability in various applications. The knife is specifically designed for hunting, but it is also well-suited for hiking and fishing."
    ],
    "marttiini.sunset": [
        "This knife draws inspiration from the renowned Finnish architect Alvar Aalto. His diverse styles, such as modernism and naturalism, are evident in this unique model. The handle's shape is simple, yet it is adorned with well-matched earthy colors. The handle is made of heat-treated birch, dyed plywood, and curly birch. The blade is a beautiful 10 cm Damascus steel, and the sheath is genuine black leather."
    ],
    "marttiini.suomi-finland": [
        "The roots of the Suomi-Finland knife reach back more than 20 years. When Finland celebrated 80 years of independence in 1997, Marttiini naturally marked the occasion by crafting a special knife. In 2009, the design was refined to give it an even more distinguished appearance.",
        "At the end of the handle is the Finnish Lion, cast in metal, symbolizing the strong spirit of Finnish perseverance with which our forefathers secured the nation’s independence. The Lion is also stamped on the sheath as a proud emblem of Finnish heritage.",
        "This knife is delivered in a wooden gift box"
    ],
    "marttiini.superflex-filleting-knife-10": [
        "The classical filleting knife has been remodelled both in its appearance and its features. The blade is even more flexible than before. This filleting knife is perfect for preparing perch.",
        "The handle is from thermally treated Finnish birch. The surface patterns applied to the handle with laser technology make the surface highly textured to ensure a firmer grip of the knife. The handle is coated with a protective wax.",
        "We recommend washing by hand."
    ],
    "marttiini.superflex-filleting-knife-15": [
        "The classical filleting knife has been remodelled both in its appearance and its features. The blade is even more flexible than before. The handle is from thermally treated Finnish birch. The surface patterns applied to the handle with laser technology make the surface highly textured to ensure a firmer grip of the knife. The handle is coated with a protective wax.",
        "This blade length is suitable for processing fish of about 1 kg.",
        "We recommend hand wash."
    ],
    "marttiini.superflex-filleting-knife-19": [
        "The classical filleting knife has been remodelled both in its appearance and its features. The blade is even more flexible than before. The handle is from thermally treated Finnish birch. The surface patterns applied to the handle with laser technology make the surface highly textured to ensure a firmer grip of the knife. The handle is coated with a protective wax.",
        "This blade length is suitable for processing fish of about. 2-3 kg.",
        "We recommend hand wash."
    ],
    "marttiini.taiga-lapp-knife": [
        "Taiga, or the vast arctic forest zone, is a popular hiking area where a knife is handy to have. The Taiga Lapp Knife is a special knife that combines a beautiful two-tone birch handle, reflecting the diverse forest of the taiga, with a stainless chrome blade featuring an engraved taiga landscape. The knife also includes a genuine vegetable-tanned leather sheath.",
        "The Taiga Lapp Knife is produced in limited quantities and is sold exclusively in Marttiini's stores and online shop."
    ],
    "marttiini.tervas": [
        "This unique Tervas knife gets its name and color from the resinous stump of a conifer tree. Tervas is warm brown, smells of resin, and is the best material for campfire wood. Hikers can use it to light a fire even in the rain.",
        "The handle of the Tervas knife is made of heat-treated curly birch and reindeer antler. The stunning 10 cm Damascus blade is stainless steel, and the black sheath is made of genuine leather."
    ],
    "marttiini.tundra-cb": [
        "The Tundra is a full-blooded bushcraft all-round knife for the demanding user. This bushcraft knife is designed for heavy-duty use. Made of of high-strength stainless steel, the full tang structure and robust blade provide excellent durability. The blade and the full tang are 3.5 mm thick.",
        "On this knife, traditional materials go hand in hand with modern design. The handle is made of Finnish curly birch. The red details on the handle and leather sheath seal the dynamic look.",
        "The Tundra knife is available with two handle options: deadwood-like, gray-waxed curly birch",
        "and natural-colored, waxed curly birch (Tundra CB). The surface of the waxed wood and the design of the handle ensure a firm grip. The sturdy leather sheath is reinforced with rivets.",
        "If needed, the knife handle parts can be re-tightened. The screw has a Torx T10 head."
    ],
    "marttiini.tundra-gr": [
        "The Tundra is a full-blooded bushcraft all-round knife for the demanding user. This bushcraft knife is designed for heavy-duty use. Made of of high-strength stainless steel, the full tang structure and robust blade provide excellent durability. The blade and the full tang are 3.5 mm thick.",
        "On this knife, traditional materials go hand in hand with modern design. The handle is made of Finnish curly birch. The red details on the handle and leather sheath seal the dynamic look.",
        "The Tundra knife is available with two handle options: deadwood-like, gray-waxed curly birch (Tundra GR) and natural-colored, waxed curly birch",
        ". The surface of the waxed wood and the design of the handle ensure a firm grip. The sturdy leather sheath is reinforced with rivets.",
        "If needed, the knife handle parts can be re-tightened. The screw has a Torx T10 head."
    ],
    "marttiini.tweezers-for-fish-bones": [
        "The tweezers are designed to fit well in your hand. The inner surface of the tweezers is grooved to ensure a firm grip on the slippery surface of fish bones. The tweezers are made of stainless steel."
    ],
    "marttiini.viserrys": [
        "This unique model is inspired by spring and the cheerful birdsong of the season. The handle features a variety of materials that harmonize beautifully: reindeer antler, heat-treated birch, curly birch, and dyed veneer. The blade is a handy 6 cm Damascus steel, and the sheath is made of genuine black leather."
    ],
    "marttiini.vuonelo": [
        "Vuonelo is a Lappish word, referring to a female reindeer over one year old – a young maiden. It symbolizes vitality and the strong beauty of the northern wilderness. In the same way, the Vuonelo knife reflects this youthful energy and delicacy, combining elegance with northern tradition in a truly unique form."
    ],
    "marttiini.wild-boar": [
        "The butt of the knife features a wild boar head on a cast ferrule. The curly birch handle with a finger groove is color-waxed to withstand use and ensure a good grip. The razor-sharp blade is made of durable stainless steel.",
        "The knife comes in an elegant wooden box, making it a perfect gift."
    ],
    "marttiini.wild-reindeer-11": [
        "The Marttiini Wild Reindeer 11 is a beautiful and versatile general-purpose knife that reflects the charm of northern nature. It is an iconic Marttiini blade model, developed in the ’30s by Janne Marttiini himself. The knife features a lynx blade with a blood groove and a slightly upturned tip hook, making it an excellent reliable tool for wilderness trips.",
        "The stainless-steel blade delivers durability while the shaped handle offers a firm grip. The handle is made from Finnish curly birch and reindeer antler, ensuring a good grip and making each knife unique. The reindeer antler pattern on the handle brings a touch of northern charm. The name “Pailakka” means untamed male reindeer, symbolizing its strong and durable nature. The sheath is made of leather, adding to the knife’s practicality and elegance."
    ],
    "marttiini.wild-reindeer-13": [
        "The versatile Wild Reindeer 13 is a reliable all-around knife for outdoor enthusiasts. The Lynx blade, with a blood groove and a slightly upturned blade tip, is an iconic Marttiini blade model, developed in the ’30s by Janne Marttiini himself. The stainless steel blade (1.4034, HRC 53,5-55) delivers durability while the shaped handle offers a firm grip."
    ],
    "marttiini.witch-s-tooth": [
        "According to old beliefs, the rattle made of reindeer antler at the end of the handle keeps the evil spirits at bay so that the user of the knife may eat in peace. A legend says that this knife model belonged to an old witch, who used it to carve thin slices of dried meat.",
        "The combination of curly birch and reindeer antler in the handle turn this knife into a true gem."
    ],
    "marttiini.wood-grouse-knife": [
        "This handsome bird is one of the most valued creatures in the Finnish fauna.",
        "Wood grouse's characteristic feature, a striking red eyebrow, plays an important role in this beautiful knife.",
        "The cast ferrules and the beautiful curly birch handle make this knife a unique gift item for all those who appreciate great knives and the purity of Finnish nature.",
        "This knife is delivered in a wooden gift box."
    ],
    "marttiini.wooden-gift-box": [
        "Beautiful wood grain inside the box completes the look of the product and protects the knife. The measures of the box are 340x70x50mm.",
        "This wooden gift box is visible as \"Accessories\" with the products that the box is suitable for."
    ]
}
