{
  "id": "marttiini.cabin-chef-knife-set",
  "manufacturer": "marttiini",
  "url": "https://www.marttiini.fi/epages/MarttiiniShop.sf/en_GB/?ObjectPath=/Shops/MarttiiniShop/Products/1494000",
  "category_slug": "outdoor",
  "category_name": "Outdoor",
  "name": "Cabin Chef Knife Set",
  "slug": "cabin-chef-knife-set",
  "lead": "The Cabin Chef set – Design inspired by northern nature, powered by form and function",
  "description": [
    "The Cabin Chef set, designed by Harri Koskinen, has the essential knives for the camping and cabin kitchen. The meticulously clean lines of the knives are designed to serve function and ergonomics. The harmonious combination of beautiful design and practicality, as well as durable natural materials, guarantee that the Cabin Chef knives are a pleasure to use, time and time again.",
    "The rounded square profile of the handle are designed to accommodate different grips required for different ingredients. The handles are made of Finnish thermally modified birch – a material known for its durability and graceful aging as well as warm and pleasant feel grip. The matte finish ensures a safe grip even when wet.",
    "The blades are made of high-quality, durable stainless steel with the utmost precision for the specific use of each knife.",
    "The set includes a chef knife, a filleting knife, a fish fork, two smaller knives and a sharpening stone wrapped in a leather knife roll. The Cabin Chef knives are available individually or as a set. The set does not include sheaths.",
    "We recommend hand wash."
  ],
  "attributes": [
    {
      "name": "DIMENSIONS",
      "properties": [
        {
          "name": "Roll opened",
          "value": "44 x 29.7 cm"
        },
        {
          "name": "Weight",
          "value": "1126 g"
        }
      ]
    },
    {
      "name": "MATERIALS",
      "properties": [
        {
          "name": "Blade material",
          "value": "stainless steel (8Cr14MoV)"
        },
        {
          "name": "Handle material",
          "value": "heat treated birch,"
        },
        {
          "name": "Ferrule material",
          "value": "stainless steel"
        },
        {
          "name": "Sheath material",
          "value": "leather, brown"
        },
        {
          "name": "Sharpening stone material",
          "value": "phyllite"
        }
      ]
    }
  ],
  "images": [
    "greyhunter.com.pl/marttiini/cabin-chef-knife-set-0"
  ]
}